# LEET CODE
## Problem-577. Employee Bonus 

Class: Easy

Source: https://leetcode.com/problems/employee-bonus/

Table: Employee
| Column Name | Type    |
|-------------|---------|
| empId       | int     |
| name        | varchar |
| supervisor  | int     |
| salary      | int     |
empId is the primary key column for this table.
Each row of this table indicates the name and the ID of an employee in addition to their salary and the id of their manager.

Table: Bonus
| Column Name | Type |
|-------------|------|
| empId       | int  |
| bonus       | int  |

empId is the primary key column for this table.
empId is a foreign key to empId from the Employee table.
Each row of this table contains the id of an employee and their respective bonus.

 
### TO DO:
Write an SQL query to report the name and bonus amount of each employee with a bonus less than 1000.

Return the result table in any order.

The query result format is in the following example.

Example 1:

Input: 

Employee table:
| empId | name   | supervisor | salary |
|-------|--------|------------|--------|
| 3     | Brad   | null       | 4000   |
| 1     | John   | 3          | 1000   |
| 2     | Dan    | 3          | 2000   |
| 4     | Thomas | 3          | 4000   |

Bonus table:
| empId | bonus |
|-------|-------|
| 2     | 500   |
| 4     | 2000  |

Output: 
| name | bonus |
|------|-------|
| Brad | null  |
| John | null  |
| Dan  | 500   |

## Importing

In [3]:
import pandas as pd
from pandasql import sqldf
import numpy as np

## Data Schema

In [4]:
import pandas as pd

# Creating the Employee table
employee_data = [
    (3, 'Brad', None, 4000),
    (1, 'John', 3, 1000),
    (2, 'Dan', 3, 2000),
    (4, 'Thomas', 3, 4000)
]

employee_columns = ['empId', 'name', 'supervisor', 'salary']

# Creating the Bonus table
bonus_data = [
    (2, 500),
    (4, 2000)
]

bonus_columns = ['empId', 'bonus']

# Creating pandas DataFrames
employee_df = pd.DataFrame(employee_data, columns=employee_columns)
bonus_df = pd.DataFrame(bonus_data, columns=bonus_columns)

In [5]:
employee_df

   empId    name  supervisor  salary
0      3    Brad         NaN    4000
1      1    John         3.0    1000
2      2     Dan         3.0    2000
3      4  Thomas         3.0    4000

In [6]:
bonus_df

   empId  bonus
0      2    500
1      4   2000

## Task

In [12]:
# Define the SQL query
query = """
SELECT name, bonus
FROM Employee
LEFT JOIN Bonus USING(empid)
WHERE bonus < 1000 OR bonus IS NULL
"""

# Excute the SQL query using pandasql
result = sqldf(query, env={'Employee':employee_df, 'Bonus':bonus_df})

# Print the result DataFrame
print(result)

   name  bonus
0  Brad    NaN
1  John    NaN
2   Dan  500.0